{
    "header": {
        "target": "w",
        "formatVersion": 5,
        "hidef": true,
        "compressed": 128
    },
    "readers": [
        {
            "type": "Microsoft.Xna.Framework.Content.DictionaryReader`2[[System.String, mscorlib, Version=4.0.0.0, Culture=neutral, PublicKeyToken=b77a5c561934e089],[System.String, mscorlib, Version=4.0.0.0, Culture=neutral, PublicKeyToken=b77a5c561934e089]]",
            "version": 0
        },
        {
            "type": "Microsoft.Xna.Framework.Content.StringReader",
            "version": 0
        }
    ],
    "content": {
        "0": "种植小贴士--\n*使用肥料有助于增加农作物质量、减少工作量、或提升农作物产量。\n*果树成熟需要一整个季节，但并不需要过多打理。注意要把树苗周围的杂草石木清理干净，以便果树茁壮成长。\n*各种庄稼在当前季节结束时，就会死去。除非是可以多季节进行栽培的种类，比如玉米。\n*诸如芥兰菜与大麦等部分农作物需要用镰刀来收割。",
        "1": "……这本书是玛妮的。\n“动物们非常敏感。它们喜欢每天都得到呵护。相比干草，它们更青睐户外的嫩草。然而，在雨天的时候它们不喜欢呆在外面。开心的动物会产出更高质量的产品！”",
        "2": "当地的森林和山脉是寻找野生农作物的好地方！一名合格的采集者会时常清除这些区域的任何杂草、树桩或石头，让野生农作物有足够的生长空间！\n专家级采集者会懂得培育野生农作物的秘密，使它们可在农场生长。是不是很厉害？",
        "3": "渔夫，第一幕。\n泰克斯：戈尔迪，你是怎么钓到这么多鱼的？我怎么努力都做不到你那么厉害！\n戈尔迪：你必须选择成为职业渔夫……然后通过训练逐渐提升钓鱼的速度！\n泰克斯：所以你是说提高钓鱼技能就能加快钓鱼的速度？\n戈尔迪：是的。你甚至能掌握到制作浮标的技术，进一步提高捕鱼能力。话就到此了，你走吧！",
        "4": "矿井到底有多深？\n长久以来，星露谷的冒险者们都无法回答这个深奥的问题……其实，这个问题的答案无人知晓。\n有许多深入矿井探索的人都一去不复返……\n不过，有几名勇敢的探险老手真的抵达了矿井深处并平安返回。\n据他们所说，矿井主要分为三个不同的区域，每个区域都有对应的怪物与宝藏。\n有些冒险者自称发现了巨大的地下湖泊以及诡异的生物……不过至今也没人能够证明此事。",
        "5": "一个老农民的日记：\n我搬来这里有一年了，我开始和当地居民交流起来。有朋友的感觉真好！他们送给我很多礼物，甚至包括他们珍藏的秘密家庭食谱！我受益良多。",
        "6": "“稻草人”\n一旦开始在农场上种植大面积的庄稼，你就得准备好迎接乌鸦的拜访。每天早上，你都有可能发现一只只乌鸦把你辛苦换来的劳动果实当作早餐饱餐一顿了！\n想要避免这些烦人的乌鸦吃掉你的庄稼，其中一种方法就是在庄稼旁边放置稻草人。\n请注意，稻草人的保护范围是有限的。如果你的农场很大的话，你就需要多放置几个稻草人。\n稻草人会记录它们一共吓走了多少只乌鸦。你可以据此判断稻草人是否置放在了最有效的位置上。\n\n* “稻草人收藏系列”可不仅仅是用来观赏的！它们也能像正常的稻草人那样发挥作用。",
        "7": "星之果实的秘密\n——\n几千年以来，人们一直对星之果实的神秘力量感到好奇……但是从来没有人知道它们的来历。\nR.J.库特勒教授是奇异水果研究方面的领军人物，他是这么说的：“我们已经发现，陨石上面找到的遗传物质跟星之果实的遗传信息十分相似，不过未能证实两者是完全一致的。”\n无论它们来自何方，可以肯定的是这种奇妙的水果非常的美味……甚至传闻有人在吃了这些水果后获得了特殊的能力。",
        "8": "草原王者大冒险——超热门电子游戏！\n\n你知道吗？任何通关“草原王者大冒险”的玩家都会自动进入到一个特别奖励的抽奖环节。\n\n你知道吗？游戏开发者说主角取材于一个真实的人物……一位来自宝石海上的大草原岛的牛仔英雄！",
        "9": "——关于钻石生产的研究——\n\n经过我多年在矿井里的研究，我发现了一些关于钻石出现频率的规律。\n我的研究只涉及到矿井里面分布的那些石头……那些可以用镐头敲碎的石头。其他来源的矿产尚需进一步研究。\n钻石似乎只在 50 层或以上的矿井中形成。在 50 层时，大概每 500 块石头中就有 1 块矿石是富含钻石的。\n在 50 层以上，钻石出现的概率似乎以约每层 0.000016 的数值增加。真是一种罕见的宝石啊！\n——M·贾思博",
        "10": "——酿酒师指南——\n   啊……酿酒！\n酵母浓郁的香气从雪松阁楼中飘过……新伐木头的花一般的音调在冬季的夜晚起舞……但是我有点偏题了。你可能对酿酒的实用方面更感兴趣……\n如果要酿酒，你需要一个小桶。首先你需要有小桶的蓝图。\n小桶可以用来盛装多种产品。如果将蔬菜放在里面，小桶会产生蔬菜汁。蔬菜汁的酿造时间最短。\n如果将小麦放在桶里，会产生啤酒。啤酒需要一段时间来酿造，但它很能赚钱。\n将啤酒花放在小桶里将酿造深受喜爱的“淡啤酒”。\n将水果放在小桶中来酿造果酒。果酒的酿造时间最长，但是由最好的水果制成的果酒非常值得等待！\n对你的小桶保持耐心……当它完全静止时就酿好了。适量饮用，否则你一定会后悔的！",
        "11": "——神秘的矮人——\n矮人自称“Smoluanu”……翻译过来就是“天空人”的意思。这对生活在地下深处的一群人来说是很奇怪的名字，不是吗？\n矮人的另一个神秘特点是他们与生俱来的先进技术。尽管同事们嘲笑我，根据这些证据我还是提出了一个新理论：\n我相信矮人是从前高度文明的幸存者，很久以前他们的星际交通工具在这个星球上撞毁。\n我认为这艘矮人飞船开始往地下钻孔，一直钻到地下深处……而随着时间的推移，矮人适应了新的地下生活环境。\n我的同事问：“他们为什么不来地上，不住在地表呢？……也许他们之前的行星有很厚的大气层保护他们不受恒星辐射，他们根本无法在我们的阳光下生存。\n这可以解释为什么他们只会在夜间出现在地面上活动，从我们的房子中取走他们需要的东西……\n\n-M.贾思博",
        "12": "——由巴之书摘录——\n\n在时间开始流动之前，天地间只有无边无际的金光。\n那光把自己叫做……“由巴”。\n由巴想要得到更多。\n由巴把金光搅拌成了一个漩涡。由巴转啊转啊转，直到漩涡的中央出现了一个大洞。\n这个洞里面诞生出了一粒种子。\n由巴让金光平静了下来。\n由巴让它不断地平静，平静，最终金光变成了土壤。\n由巴把种子埋在了这土壤之中。\n种子萌发了，看哪！一条藤蔓向着天空生长着、蜿蜒着、试探着，在金色的虚空之上留下一道蜿蜒的黑影。\n11 天之后，藤蔓结出了果子。\n由巴用他的智慧把果子坚硬的果皮剥了下来，并在里面看到了世界。\n世界就是这样形成的。",
        "13": "——农民结婚手册——\n在你向任何人求婚之前，你得先跟对方约会一段时间（用皮埃尔商店里面的花束来约会对象）。\n而在你求婚前，你得先准备一个“美人鱼吊坠”。所有人都知道这个吊坠所代表的意义。\n传说在狂风暴雨的日子，星露谷会出现一个老水手的鬼魂，其手中就是抓着这样的一个吊坠。\n在婚礼之后，你的伴侣会搬过来跟你一起住。记得要好好对待你的新婚伴侣……即使在结婚以后他们依然会喜欢收到礼物！\n\n（此文章由皮埃尔友情赞助）",
        "14": "渔夫，第二幕。\n泰克斯：戈尔迪，给我讲讲你最棒的有关渔夫的故事吧。\n戈尔迪：*叹气*……我以前可抓到过不少大鱼，有很多是很稀有很难抓的种类……但有一只鱼和我整整搏斗了三天三夜。\n戈尔迪：我将这鱼叫做……“传说之鱼”。那家伙个头很大……我越用力拉线，他也就越用力挣扎。我一走神，它就把我的船弄成了两半。在那之后我就再也没钓过鱼了。\n泰克斯：你觉得以后会有人抓住他吗？\n戈尔迪：唔……如果这人是个捕鱼大师，又抓到过所有稀有鱼类，还确保它们都得以正确喂养的话……也许会的吧。毕竟你要尊重水这种东西啊，儿子。\n泰克斯：……儿子……？难道你是……我父亲？\n戈尔迪：没错，我就是你父亲。\n\n**狗血的音乐响起**",
        "15": "——科技报告！——\n\n某种名为“宝石复制机”的先进科学机器的设计图纸已被发布。\n这个机器可以凭空种出水晶，为其拥有者提供源源不绝的贵重宝石！\n以下为使用说明：将选好的宝石放入机器之中……\n然后耐心等待，多日之后，宝石复制机便会将你放入的宝石完美复制！\n当机器停止抖动时，就证明工作完成了。在你取走宝石之后，宝石复制机便会继续复制宝石的工作……除非想要更改所生产的宝石种类，否则就无需更换原宝石！\n可惜的是，这机器无法复制极为稀有的“五彩碎片”宝石……不知为何，这种碎片的电动势对机器有所排斥。",
        "16": "——传奇之鱼的秘密——\n\n渔夫们经常说起五只稀有而独特的鱼，只有经验极为丰富的渔人才能捕捉得到。一旦被抓住，这鱼就再也不会出现了。\n\n绯红鱼出没于夏日温暖的海洋之中。曾在海滩最东边被目击到。\n\n冰川鱼仅在冬天出没，出没于煤矿森林南端的箭头岛，森林与河流交汇处。\n\n鮟鱇鱼出没于秋季，城镇北方，河流从山上流下之处。\n\n据说还有一只奇怪诡异的鱼游走于下水道之中。\n\n\n\n最后一条鱼是属于一种从未被捕捉到过的物种，名为“传说之鱼”据说其生活在山上湖底一个沉入水中的木桩里，只在春季下雨时出来偷吃青蛙产的卵。只有技巧最为高超的渔人才能抓住这条鱼。\n\n钓鱼需要长期的锻炼，终有一日你会抓到这些稀有的鱼的。记住，保护生态平衡，不要过度捕鱼。",
        "17": "……我在出鹈鹕镇的隧道里看到了一些奇怪的东西。黑暗中有一扇小门。但我无法将其打开。\n\n——冈瑟",
        "18": "冈瑟的字条：哇，这个图书馆真的变得不同凡响了，多亏了你的帮忙！非常感谢！",
        "19": "哥布林^M.贾思博著^^这种被称作“哥布林”的生物起源于布鲁迈尔山另一侧的东北部森林。他们拥有着绿色的皮肤、亮红色的眼睛，并散发着恶臭，对于没有经验的旅行者来说，与他们初次相遇，会感到非常的可怕。^^尽管有着令人不安的相貌，但是，哥布林却拥有和人类相似的智慧和情感，对于学习我们的习俗和语言也没有任何障碍。我曾遇到过的哥布林，在我表示没有恶意之后，还是很友善和蔼的。不幸的是，由于几个世纪以来人们对他们的不信任和错误对待，很多哥布林开始投靠巫师、术士、死灵法师等等邪恶人士麾下效命。^^哥布林的传统食物大部分由蛆肉组成，这些蛆肉主要来源于哥布林家乡森林中的又大又肥的蛆。在特殊的场合，哥布林也会享用一种叫做“虚空蛋黄酱”的美食……这也许是哥布林菜谱中的最顶级菜肴了。",
        "20": "大象嚎叫 海上波涛 参加盛宴 镇上某处 里有乾坤^^鸭子闻声 蛋落下来 黄鹂远去 酱到他方 餐厅遗失 厅外有人^^奇闻古今 怪事连连 小声絮语 面面相觑 包罗万象 玩故习常 具体何事 箱里寻求",
        "Missing": "这里少了一本书……"
    }
}