{
    "header": {
        "target": "w",
        "formatVersion": 5,
        "hidef": true,
        "compressed": 128
    },
    "readers": [
        {
            "type": "Microsoft.Xna.Framework.Content.DictionaryReader`2[[System.String, mscorlib, Version=4.0.0.0, Culture=neutral, PublicKeyToken=b77a5c561934e089],[System.String, mscorlib, Version=4.0.0.0, Culture=neutral, PublicKeyToken=b77a5c561934e089]]",
            "version": 0
        },
        {
            "type": "Microsoft.Xna.Framework.Content.StringReader",
            "version": 0
        }
    ],
    "content": {
        "1": "Stir Fry/蔬菜什锦盖饭！这是一种能吃到健康蔬菜的最佳方式。用少许芝麻油炒一下蔬菜，再加入足够的新鲜生姜和大蒜。现在，深吸一口气……嗷，味道果然很不错。/蔬菜什锦盖饭",
        "2": "Coleslaw/卷心菜沙拉！想吃上一大盘清淡而柔软的卷心菜？不光是你有这样的想法。其实卷心菜沙拉可以做得更加美味。做这道菜，一定要选取多汁、新鲜的卷心菜。撒上一点醋和沙拉酱就可以了。啊，非常脆爽。/卷心菜沙拉",
        "3": "Radish Salad/萝卜沙拉！没有什么菜能够比得上一盘新鲜的胡椒萝卜。这让我想起来晚春的时候……我的母亲会将新鲜的萝卜切成片，然后撒上一点盐和胡椒粉，和全麦面包一起吃。啊，这些都是往事……我好像有点跑题了，仔细看好……/萝卜沙拉",
        "4": "Omelet/煎蛋卷！这是一道很简单的菜，但是，一不小心就会做坏。一个完美的煎蛋卷简直就是一件艺术品。这是一个纯金色、闪闪发光的天使之蛋，接下来，我要向你们展示一下我的绝技……/煎蛋卷",
        "5": "Baked Fish/烤鱼！每当我在家做这道菜的时候，我那两只猫就会抓狂。我需要安排一位帮厨来看着它们，防止它们跳上来抢鱼吃。一定要选取新鲜的鱼，最好是你亲手钓的。好了，现在我要把鱼放到铺好的绿色蔬菜上……/烤鱼",
        "6": "Pancakes/薄煎饼！有的时候，我会被精致、复杂的菜肴吸引……不过，一块简单的薄煎饼也可以抚慰我的心灵。建议在这一层层热煎饼上涂上黄油和枫糖浆。/薄煎饼",
        "7": "Maki Roll/生鱼片寿司！柔软的米饭将鱼的鲜味包裹其中。喜欢口味重点的，也可以来一点芥末。说着说着，我就开始流口水了。哦，我太喜欢寿司了……/生鱼寿司",
        "8": "Bread/面包！制作面包可以说是一件非常复杂的事情，但是，我可以让它变得很简单。最重要的材料当然就是面粉了。不过，在和面之前，我们得让醒一下酵母。它们喜欢温水。我喜欢使用普通的糖，不过用蜂蜜或者枫糖浆也是可以的！/面包",
        "9": "Tortilla/墨西哥薄饼！看这个节目的时候，有多少人还在咬着用微波炉烤出来的傻瓜式玉米煎饼呢？丢人啊。那样吃薄饼还不如直接把玉米粒裹到破旧的抹布里。现在，都给我听好了。如果你尝了我手工制作的新鲜玉米煎饼，你就再也不会像以前一样……/墨西哥薄饼",
        "10": "Trout Soup/鳟鱼汤！这刚铺捉上来的鳟鱼不知为何让我有点小激动。也许是河鲜的鲜味刺激到我了。总之，我今天要和你们分享一种鳟鱼汤的绝妙烹饪法……/鳟鱼汤",
        "11": "Glazed Yams/琉璃山药！现在是吃山药的好时节，品尝这些可爱的块茎时，没有比抹上又甜又稠的糖浆更好的了吧？你只需要准备一根干净、成熟的山药和一把糖。现在，看我怎么来做……/琉璃山药",
        "12": "Artichoke Dip/水煮洋蓟！这是让洋蓟的营养进入你体内的绝妙方式。我自己的话，就不会用什么东西蘸着吃。我只是像喝奶昔一样将这道菜大口吃下去。非常美味。/水煮洋蓟",
        "13": "Plum Pudding/葡萄干布丁！面对这种甜份充足的美食，小杰克霍纳已经显得迫不及待了。但谁会责怪他呢？这葡萄干真的是又香又甜，再加上适度的酸味，完全可以打开你沉睡中的味蕾。你真的需要亲身体验一下……/葡萄干布丁",
        "14": "Chocolate Cake/巧克力蛋糕！在冬季的寒夜里，没有比品尝浓香的巧克力蛋糕更让人感到温暖的了吧？在我的帮助下，你很快就可以制作出最为精美的蛋糕。现在，你需要加入足够的糖……/巧克力蛋糕",
        "15": "Pumpkin Pie/南瓜派！在我家里，冬日星盛宴的时候，会吃南瓜派，这已成一个习俗。如果你不吃上一口从农场采摘下来的新鲜、美味的南瓜，就会觉得这个季节总缺少了些什么。加上一点肉豆蔻、桂皮和丁香，你的眼前就会浮现出一片金红之地……/南瓜派",
        "16": "Cranberry Candy/蔓越莓糖果！这是一款你过新年时需要的绝妙糖果。蔓越莓本身就带有苦味，但是，把它们浸到大量的糖水中之后，尝起来简直就像是天使的眼泪。现在，看我怎么来做……/蔓越莓糖果",
        "17": "Pizza/披萨！披萨是永恒的烹饪经典，这也是有其原因的。金黄色的精美饼胚已经出炉了，先浇一层蒜香浓郁的番茄酱，然后，再浇上一层让人口水直流的奶酪。这才刚刚开始！让我们在上面撒些新鲜胡椒和番茄。我的天！/披萨",
        "18": "Hashbrowns/薯饼！这道菜看似简单，不过，真的是非常美味！先将土豆切成丝，然后撒上适量的盐，再用你最喜欢的热油将土豆丝炸好。感觉很简单，是吧？好吧，我可以给你们一些建议，让你们做起来更加简单……/薯饼",
        "19": "Complete Breakfast/完美早餐！上周，我们教了你们如何制作土豆煎饼。这周，我要教你们如何将土豆煎饼和其它食材结合，做出一顿丰盛的爱心早餐。这个肉真的能填饱你的肚子，并且给你充足的能量，让你一整天工作都有劲。/完美早餐",
        "20": "Lucky Lunch/幸运午餐！在古老的传说中，这是一顿连幸运和财富之神都无法阻挡的午餐。你吃完之后，就会将幸运之气引入你的肚内，这股幸运之气会给你带来好运直到午餐全部被消化。听起来怪怪的，是吧？我不能说我一定相信，但是，不管如何，这午餐确实是美味啊！/幸运午餐",
        "21": "Carp Surprise/嘿，你是否有过一大堆鲤鱼，但又不知道如何来处理？嗯，我也是。好吧，我找到了一个方法，可以解决这个普遍存在的问题。我把它称作……惊喜鲤鱼。做起来很简单，但需要很多的鲤鱼……/惊喜鲤鱼",
        "22": "Maple Bar/枫糖棒！为什么枫糖棒总是第一个从甜甜圈盒中消失？令人费解吧，那是因为你们做的普通枫糖棒吃起来就像一个甜甜的冰球。同意吗？好吧，稍后就给你们展示我的配方。从这些派中，你真的能吃出森林的味道。好了，你所需要的就是一些正宗、上乘的枫糖浆……/枫糖棒",
        "23": "Pink Cake/有一位来自鹈鹕镇的观众最近写了一封信给我……我们来看看……她的名字是海莉。她写道：“上次我在祖祖市的时候，吃到了你做的粉色蛋糕，我马上就爱上它了。你能在下期节目中分享一下粉色蛋糕的配方吗？”。好吧，为什么不呢？这是一款非常棒的蛋糕。并且，你永远不会猜到其秘方是……甜瓜！/粉红蛋糕",
        "24": "Roasted Hazelnuts/烤榛子！我的房子后面有一颗古老而漂亮的榛子树，每年，我都会邀请全家人过来举行一次果仁烧烤宴会！一旦我们开始烧烤，周围的邻居就会闻香而来。烤榛子的浓香真的是不可阻挡啊。好了，来看看我的家族秘方……/烤榛子",
        "25": "Fruit Salad/水果沙拉！这是一道健康、美味的菜肴，可以让你每天都过得舒畅。最重要的就是要选取成熟的水果。可别给我提那些超市里卖的隔夜水果……我所说的是新鲜摘取的多汁、美味水果。好吧，现在仔细看好了……/水果沙拉",
        "26": "Blackberry Cobbler/黑莓脆皮饼！这道菜总会让我想起星露谷。秋季的那几天，星露谷到处都是我人生中吃过最美味的黑莓。如果你家里有一些这样的黑莓，我极力建议你将它们做成这简单黑莓脆皮饼。/黑莓脆皮饼",
        "27": "Crab Cakes/蟹黄糕！蟹肉本身就比较细腻，但是，将它与面包屑、鸡蛋搅拌混合之后，就变得非常入味了。这就是我喜欢吃蟹黄糕的原因。不过，在你敲碎蟹壳之前，先看一下我这个非常关键的调味料……/蟹黄糕",
        "28": "Fiddlehead Risotto/意式蕨菜炖饭！蕨菜看上去很漂亮，但是，直接吃的话，会感觉非常乏味。所以，你得多注意自己加入的香料。实话说，意式蕨菜炖饭要做好，还是非常难的。不过，在我的帮助下，你一定会成功做出一道美味的意式蕨菜炖饭。/意式蕨菜炖饭",
        "29": "Poppyseed Muffin/虞美人籽松糕！虞美人会开出非常迷人的花朵……但是，为什么不把虞美人和这可口的松饼充分融合到一起呢？我对虞美人籽情有独钟。这虞美人籽看起来没什么特别的，但是，它们会让面包甜点更具香味和质感。并且，它们还很健康！/虞美人籽松糕",
        "30": "Lobster Bisque/龙虾浓汤！你可以亲自将这道菜献给州长。这龙虾浓汤浓郁、奶香、美味，并且会让你感受到海洋的味道。要找到一些新鲜的龙虾是最难的，不过，我相信你可以做到的。好吧，如果你觉得自己够灵巧，那就亲自用蟹笼抓一只！/龙虾浓汤",
        "31": "Bruschetta/意式烤面包！这是一道简单但非常美味的开胃菜，它真的能突显出原材料的质感。你需要准备的是面包、西红柿以及油。首先，将面包烤好。将西红柿切碎，并撒到烤好的面包上。然后，淋上一点油，就可以上桌了。我没骗你吧，做起来确实简单！/意式烤面包",
        "32": "Shrimp Cocktail/鲜虾鸡尾酒！这是另一道会让你和你的客人非常喜欢的开胃菜。我制作的鸡尾酒汁极其鲜美，我相信你一定会爱上它的。好了，第一步是……/鲜虾鸡尾酒 "
    }
}