import json
import requests

url = "https://api.zhconvert.org/convert"
headers = {
	# 指定 Content-Type 為 application/json
    # 必須培養手動設定的習慣，不然有時候沒注意到，會帶了前一支 API 的 Content-Type，會傻傻的不知道為什麼打不通
	"Content-Type": "application/json"
}

def zhconvert(text):
    request_body = {
        "text": text,
        "converter": "Taiwan",
        "userPostReplace":"",
        "userPreReplace":"齊幣=Qi 幣\n齊先生=Mr. Qi\nJOJA=Joja\n\n金制=金製\n銀制=銀製\n銅制=銅製\n鐵制=鐵製\n鋼制=鋼製\n銥制=銥製\n木制=木製\n石制=石製\n金質=金製\n銀質=銀製\n銅質=銅製\n鐵質=鐵製\n鋼質=鋼製\n銥質=銥製\n木質=木製\n石質=石製\n掙錢=賺錢\n掙取=賺取\n掙到=賺到\n掙些=賺些\n甜豌豆=香豌豆\n團子=糰子\n型狀=形狀\n帶上=帶著\n隧道掘進隊=隧道隊\n路易士=路易斯\n劉易斯=路易斯\n瑪尼=瑪妮\n鉛制=鉛製\n粗制=粗製\n烤制=烤製\n祖祖市=祖祖城\n格球=橄球\n醃制=醃製\n價值提升=售價提升\n價值上升=售價提升\n價值提高=售價提升\n價值增加=售價提升\n迴圈生產=循環生產\n精工製品=加工品\n\n紅葉捲心菜=紫高麗菜\n虛空烈酒=虛空暗影\n混合蔬菜=蔬菜雜燴\n薄煎餅=美式鬆餅\n甘藍=羽衣甘藍\n炒蘑菇=炸蘑菇\n蟹黃糕=蟹肉餅\n八爪魚=章魚\n玫瑰仙子=仙女玫瑰\n營養快線=蛋白棒\n\n冰凍稀泥=藍色史萊姆\n冰凍果凍=藍色史萊姆\n\n冰凍蝙蝠=冰霜蝙蝠\n沙塵惡靈=塵埃精靈\n\n骨頭戰士=骷髏戰士\n骨頭法師=骷髏法師\n骨頭鑰匙=骷髏鑰匙\n骨頭山洞=骷髏山洞\n石魔=石魔像\n木頭=木材\n提高=提升\n魚竿=釣竿\n女士=小姐\n甜菜根=甜菜\n灰塵精靈=塵埃精靈\n山洞昆蟲=洞穴昆蟲\n沙龍=酒吧\n山貨=山產\n紅撲撲=紅通通\n金屬棒=金屬錠\n野山葵=野辣根\n山洞蘿蔔=洞穴胡蘿蔔\n洞穴蘿蔔=洞穴胡蘿蔔\n山洞胡蘿蔔=洞穴胡蘿蔔\n鯷魚=鱭魚\n金槍魚=鮪魚\n大眼魚=玻璃梭吻鱸\n紅鯔魚=秋姑魚\n石魚=石頭魚\n綠豆=豌豆\n魚肉卷=魚肉塔可餅\n爆炒青椒=辣椒鑲起司\n椰汁湯=椰奶湯\n墨西哥薄餅=玉米薄餅\n帕爾瑪乳酪茄子=帕馬森乳酪茄子\n大米布丁=米布丁\n霜淇淋=冰淇淋\n藍莓千層酥=藍莓塔\n巨無霸餐=巨無霸特餐\n紅莓醬=蔓越莓醬\n填料麵包=填料\n根菜拼盤=塊根拼盤\n大麥粉=小麥粉\n龍葵=羊肚菌\n未碾米=稻穀\n水稻芽=秧苗\n魔法糖冰棍=魔法冰糖棒\n甜菜根=甜菜\n草籽=草種\n愛爾淡啤酒=淡艾爾啤酒\n矮人語教程=矮人語翻譯指南\n矮人語教學=矮人語翻譯指南\n能量飲品=能量補劑\n蛤=扇貝\n鸚鵡螺=鸚鵡螺貝殼\n香味漿果=辛香漿果\n甜豌豆=香豌豆\n工作小食=田野零食\n大米=米\n魚籽醬=魚子醬\n魚籽=魚卵\n石基=石頭地基\n吊墜=墜飾\n史萊姆剋星戒指=蠱惑史萊姆戒指\n野蠻人戒指=野蠻戒指\n結實戒指=堅定戒指\n傑明石=三斜砷銅石\n鐵鉛礦=氯矽鐵鉛礦\n新矽鈣石=新水矽鈣石\n貓眼石=蛋白石\n赤紅貓眼石=火蛋白石\n沙岩=砂岩\n泥石=泥岩\n陶瓷碎片=星之碎片\n史前脊骨=史前椎骨\n藍爵=藍爵士\n蔬菜什錦蓋飯=什錦蔬菜蓋飯\n脆皮黑莓餡餅=脆皮黑莓派\n蔓越莓糖果=蔓越莓果汁\n柳丁=柳橙\n旋式魚餌=旋式亮片魚鉤\n大頭魚=牛頭鯰\n羅非魚=吳郭魚\n麻哈脂鯉=黃金河虎\n青花魚=長鰭鮪魚\n西鯡=鯡魚\n蛇齒單線魚=長蛇齒單線魚\n蚌=貽貝\n海鮮雜燴湯=巧達濃湯\n楓糖甜甜圈=楓糖板擦甜甜圈\n蝦雞尾酒=雞尾酒蝦\n萬能魚餌=野性魚餌\n樹肥=樹木肥料\n\n亞歷克斯=艾力克斯\n艾利歐特=艾略特\n潘妮=佩妮\n克林特=克林\n德米特裡厄斯=迪馬崔斯\n德米特里厄斯=迪馬崔斯\n艾芙琳=伊芙琳\n賈斯=潔絲\n科羅布斯=柯洛布斯\n皮埃爾=皮耶爾\n喬迪=喬蒂\n桑迪=沙蒂\n文森特=文森\n法師=巫師\n甜心=寶貝\n美莓=鮭莓\n鼓眼魚=玻璃梭吻鱸\n淘盤=淘金盤\n楓糖條=楓糖板擦甜甜圈\n楓糖棒=楓糖板擦甜甜圈\n杏子=杏桃\n韭菜=韭蔥\n大門=圍欄門\n美乃滋機=美乃滋製造機\n蟲餌盒=蟲餌箱\n煤炭窯=木炭窯\n雨水圖騰=降雨圖騰\n火炬=火盆\n木頭火炬=木製火盆\n石頭火炬=石製火盆\n鏤空火炬=雕刻火盆\n木牌=木製告示牌\n石牌=石製告示牌\n三倍即溶咖啡=三倍濃縮咖啡\n凡吉爾共和國=芬吉爾共和國\n蛋蛋節=彩蛋節\n復活節=彩蛋節\n鎮長路易斯=路易斯鎮長\n罐頭瓶=醃製罐\n奇蹟=奇跡\n樂隊=樂團\n銅棒=銅錠\n鐵棒=鐵錠\n金棒=金錠\n銥棒=銥錠\n小龍蝦=螯蝦\n蝦=蝦子\n貽貝=淡菜\n蚌=淡菜\n浮木=漂流木\n完美早餐=早餐套餐\n風化地板=陳舊地板\n黃金礦石=金礦石\n普通蘑菇=蘑菇\n大壺牛奶=大瓶牛奶\n鼓塊=鼓方塊\n長笛塊=長笛方塊\n幸運紫色短褲=幸運紫色內褲\n影子人=暗影人\n\n?=？\n!=！\n(=（\n)=）",
        "userProtectReplace":"保存\n工具欄\n本地\n頭像\n夥計\n壁紙\n大蒜\n賭注\n:)\n"
        # don't have this parameter
        # "EllipsisMark": 1,
        # "QuotationMark": 1,
        # "RemoveSpaces":1,
        # "trimTrailingWhiteSpaces" : True
    }

    # 以 post method 發出 request
    response = requests.get(url, json=request_body)
    print(response.json())
    # 由於知道 response 的 Content-Type 是 application/json
    # 可用 json() 讀取 Response 內容
    # 應用 json 套件作排版顯示，不然資料量大的時候，閱讀會比較困難
    # 使用 indent 參數設定縮排為 4 個空格
    text = response.json()['data']['text']
    return text
    # print("Response:", json.dumps(response.json(), ensure_ascii=False, indent=4))

def Read_json(file_path):  
    with file_path.open('r', encoding='utf-8') as file:
        data = json.load(file)
        return data

if __name__ == '__main__':
    zh_cn = '德米特里厄斯'
    print(f'原句子：{zh_cn}')
    print(f'台灣化：{zhconvert(zh_cn)}')